# OutlineLineWeight Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayDiagramSettings..::..OutlineLineWeight Property
AnalysisDisplayDiagramSettings Class See Also
---
Line weight of outline and fence lines in the diagram.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public int OutlineLineWeight { get; set; }
```

Visual Basic
---
```text
Public Property OutlineLineWeight As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int OutlineLineWeight {
	int get ();
	void set (int value);
}
```

# See Also
AnalysisDisplayDiagramSettings Class
Autodesk.Revit.DB.Analysis Namespace